src/Catalogs/уатРегистрационныеДокументы/уатРегистрационныеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатРегистрационныеДокументы</name>
  <comment>(уат)</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Организация</name>
    <comment>Организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринадлежностьДокументов</name>
    <type>
      <types>EnumRef.уатПринадлежностьДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.уатВидыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецДокументов</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.уатТС</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <comment>Дата выдачи документа</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <comment>Дата окончания срока действия</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.уатСтатусыДействия</types>
    </type>
  </attributes>
  <attributes>
    <name>КемВыдан</name>
    <comment>Кем выдан документ</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытыеКатегории</name>
    <comment>Категория документа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяКартинка</name>
    <type>
      <types>CatalogRef.уатРегистрационныеДокументыПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКатегория</name>
    <comment>Помечено на удаление в релизе 1.1.9.1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Категории</name>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.уатКатегорииДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>Открыта</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/уатРегистрационныеДокументы/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьОткрытыеКатегории() Экспорт
	ОткрытыеКатегории = "";
	Если ВидДокумента.УчетКатегорий Тогда
		списКатегории = Новый СписокЗначений;
		Для Каждого ТекКатегория Из Категории Цикл
			Если ТекКатегория.Открыта Тогда
				списКатегории.Добавить(СокрЛП(ТекКатегория.Категория));
			КонецЕсли;
		КонецЦикла;
		списКатегории.СортироватьПоЗначению();
		
		Для Каждого ТекЭлем Из списКатегории Цикл
			ОткрытыеКатегории = ОткрытыеКатегории + ТекЭлем.Значение + ", ";
		КонецЦикла;
		Если НЕ ПустаяСтрока(ОткрытыеКатегории) Тогда
			ОткрытыеКатегории = Лев(ОткрытыеКатегории, СтрДлина(ОткрытыеКатегории)-2);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		Если НЕ ЗначениеЗаполнено(Наименование) Тогда 
			Наименование = уатНастройкиШаблонов.СформироватьНаименованиеПоШаблону("Справочник_уатРегистрационныеДокументы", ЭтотОбъект);
		КонецЕсли;
	
		ЗаполнитьОткрытыеКатегории();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
